/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */

package com.mai.textanalyzer.web.vaadin.pages.multiclassifierlearning;

import java.util.HashMap;
import java.util.Iterator;
import javax.persistence.Convert;
import org.json.simple.JSONObject;
import org.json.simple.parser.JSONParser;
import scala.util.parsing.json.JSONArray;
import java.sql.*;
import java.sql.Connection;
import java.sql.DriverManager;
import java.sql.ResultSet;
import java.sql.Statement;
import org.h2.tools.DeleteDbFiles;

//import scala.util.parsing.json.JSONObject;
//import javax.json.JsonObject;

/**
 *
 * @author artee
 */
public class ParserJSON {
        public static void main(String[] args) throws Exception {
            
            String json = "{\"SVM\":{\"Геология\":0.01282051282051282,\"Государство и право\":0.010073260073260074,\"Уголовное право и процесс\":0.0016483516483516484,\"Арбитражный процесс\":0.0029304029304029304,\"География\":0.01227106227106227,\"Сексология\":0.0016483516483516484,\"Международное публичное право\":7.326007326007326E-4,\"Языкознание, филология\":0.01684981684981685,\"Естествознание\":0.009706959706959707,\"Страхование\":0.0014652014652014652,\"Административное право\":5.494505494505495E-4,\"Инвестиции\":0.004761904761904762,\"Медицинские науки\":0.0038461538461538464,\"Астрономия\":0.01282051282051282,\"Банковское дело\":0.011904761904761904,\"Компьютерные науки\":0.0016483516483516484,\"Медицина, здоровье\":0.014652014652014652,\"Валютные отношения\":0.0038461538461538464,\"Биржевое дело\":1.8315018315018315E-4,\"Управление\":0.006776556776556777,\"Физкультура и спорт\":0.010073260073260074,\"Экономика\":0.008241758241758242,\"Международное частное право\":0.0016483516483516484,\"Бухгалтерский учет и аудит\":0.010256410256410256,\"Геополитика\":0.0027472527472527475,\"Информатика, программирование\":0.012637362637362638,\"Управленческие науки\":0.006043956043956044,\"Экономико-математическое моделирование\":0.015384615384615385,\"ЕГЭ\":0.009706959706959707,\"История техники\":0.00934065934065934,\"Право, юриспруденция\":0.005311355311355312,\"Криминология\":0.00347985347985348,\"Ботаника и сельское хоз-во\":0.012454212454212455,\"Этика\":0.013186813186813187,\"Финансы\":0.009157509157509158,\"Деньги и кредит\":0.002564102564102564,\"Иностранный язык\":0.01446886446886447,\"Физика\":0.015567765567765568,\"Логистика\":0.015201465201465201,\"Москвоведение\":0.009523809523809525,\"Языковедение\":0.015018315018315019,\"Музыка\":0.015384615384615385,\"Экологическое право\":0.001098901098901099,\"Налоги, налогообложение\":0.0031135531135531138,\"Биология и химия\":0.010622710622710623,\"Военная кафедра\":0.0062271062271062275,\"Логика\":0.0184981684981685,\"Металлургия\":0.01703296703296703,\"Биология\":0.01098901098901099,\"Краеведение и этнография\":0.008241758241758242,\"Риторика\":0.01227106227106227,\"Экономическая география\":0.00641025641025641,\"Коммуникации и связь\":0.017765567765567765,\"Маркетинг\":0.017948717948717947,\"Теория государства и права\":0.0032967032967032967,\"Транспорт\":0.017582417582417582,\"Промышленность, производство\":0.016483516483516484,\"Информатика\":0.016666666666666666,\"Наука и  техника\":0.015018315018315019,\"Менеджмент\":0.017216117216117217,\"Юриспруденция\":0.0062271062271062275,\"Геодезия\":0.007142857142857143,\"Гражданское право и процесс\":0.005128205128205128,\"Международные отношения\":0.00934065934065934,\"Психология\":0.011355311355311355,\"Культурология\":0.01227106227106227,\"Математика\":0.018864468864468863,\"Журналистика\":0.01611721611721612,\"Экология\":0.00934065934065934,\"Издательское дело и полиграфия\":0.008424908424908424,\"Химия\":0.008608058608058609,\"Криминалистика\":0.00641025641025641,\"Строительство\":0.015934065934065933,\"Авиация и космонавтика\":0.01282051282051282,\"Биографии\":0.013186813186813187,\"Исторические личности\":0.013736263736263736,\"Хозяйственное право\":0.001098901098901099,\"Архитектура\":0.015018315018315019,\"Муниципальное право\":0.0,\"Финансовые науки\":0.007142857142857143,\"Трудовое право\":0.002564102564102564,\"Кибернетика\":0.005128205128205128,\"Таможенная система\":0.004761904761904762,\"Радиоэлектроника\":0.014285714285714285,\"Цифровые устройства\":0.0018315018315018315,\"Право\":0.004395604395604396,\"Туризм\":0.005311355311355312,\"Религия и мифология\":0.0062271062271062275,\"Технология\":0.013736263736263736,\"Предпринимательство\":0.01575091575091575,\"История\":0.014102564102564103,\"Реклама\":0.00641025641025641,\"Социология\":0.00934065934065934,\"Теплотехника\":0.017948717948717947,\"Безопасность жизнедеятельности\":0.011355311355311355,\"Философия\":0.007692307692307693,\"Теория организации\":0.013553113553113554,\"Кулинария\":0.00989010989010989,\"Экономическая теория\":0.01098901098901099,\"Культура и искусство\":0.016483516483516484,\"Зоология\":0.002564102564102564,\"Педагогика\":0.017216117216117217,\"Политология\":0.005311355311355312,\"Статистика\":0.011355311355311355,\"Ветеринария\":0.008608058608058609}}";            
            JSONParser parser = new JSONParser();
            JSONObject json0 = (JSONObject) parser.parse(json);
            System.out.println(json0.get("SVM"));
            String json1 = json0.get("SVM").toString();
            JSONObject json2 = (JSONObject) parser.parse(json1);
            System.out.println(json2.get("Геология"));
           /*
            HashMap<String,  Double>  map = json2;
            
            Object[] list = map.entrySet().stream()
                .sorted(HashMap.Entry.<String,  Double>comparingByValue().reversed()).toArray();
            for (int i = 0; i < list.length; i++) {
                System.out.println(list[i].toString().contains(""));
            }
                //.forEach(System.out::println);
            */
            DeleteDbFiles.execute("~", "test", true);

            Class.forName("org.h2.Driver");
            try (Connection conn = DriverManager.getConnection("jdbc:h2:tcp://localhost/~/warn_test"); 
                    Statement stat = conn.createStatement()) {
                try (ResultSet rs = stat.executeQuery("select * from TOPIC")) {
                    
                    while (rs.next()) {
                        System.out.println(rs.getString("name"));
                    }



                // insert the data
                //statement.executeUpdate("INSERT INTO Customers " + "VALUES (1001, 'Simpson', 'Mr.', 'Springfield', 2001)");
                }
            } catch (Exception e) {
                e.printStackTrace();
            }            
        }
}
            /*
            // Достаем массив номеров
            JSONArray phoneNumbersArr = (JSONArray) jo.get("phoneNumbers");
            Iterator phonesItr = phoneNumbersArr.iterator();
            System.out.println("phoneNumbers:");
            // Выводим в цикле данные массива
            while (phonesItr.hasNext()) {
                JSONObject test = (JSONObject) phonesItr.next();
                System.out.println("- type: " + test.get("type") + ", phone: " + test.get("number"));
            }
            }
             */